# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [1]:
# 記得先 Import 正確的套件
import numpy as np
import pandas as pd

In [2]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [3]:
#計算每個不同種類 animal 的 age 的平均數
for a in set(df['animal']):
    print(a,df[df['animal'] == a]['age'].mean())

cat 2.5
snake 2.5
dog 5.0

In [5]:
#將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
df1=df
df1["-visits"]=df['visits']*-1
df2=df1.sort_values(by=['age','-visits'])
df3=df2.drop(['-visits'],axis=1)
df3

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [6]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.907377  0.877111  0.748000
1  0.135872  0.648807  0.170816
2  0.375516  0.732381  0.042507
3  0.954685  0.226914  0.383226
4  0.229294  0.284238  0.875122

In [7]:
#將每個數字減去該欄位的平均數
df1=df-df.mean()
df1

          0         1         2
0  0.386828  0.323221  0.304066
1 -0.384677  0.094917 -0.273118
2 -0.145033  0.178490 -0.401427
3  0.434136 -0.326976 -0.060709
4 -0.291255 -0.269652  0.431188

In [8]:
#將每個數字減去該筆資料平均數
df2=df-df.mean(axis=1)
df2.dropna(axis=1)

          0         1         2
0  0.063215  0.558613  0.364532
1 -0.708291  0.330309 -0.212651
2 -0.468647  0.413882 -0.340961
3  0.110523 -0.091584 -0.000242
4 -0.614868 -0.034260  0.491655

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [9]:
df

          0         1         2
0  0.907377  0.877111  0.748000
1  0.135872  0.648807  0.170816
2  0.375516  0.732381  0.042507
3  0.954685  0.226914  0.383226
4  0.229294  0.284238  0.875122

In [10]:
#哪一筆的資料總合最小
df.sum(axis=1).argmin()

1

In [11]:
#哪一欄位的資料總合最小
df.sum(axis=0).argmin()

2